PranjalKushwaha/Embedded/stm8/NRF24_TRANS/driver/include/REG_MG82F6D17.h
#ifndef __REG_MG82F6D17_H
#define __REG_MG82F6D17_H

#include <compiler.h> 

#define GF_7         0x80
#define GF_6         0x40
#define GF_5         0x20
#define GF_4         0x10
#define GF_3         0x80
#define GF_2         0x04
#define GF_1         0x02
#define GF_0         0x01

SFR(SP, 0x81);
SFR(DPL, 0x82);
SFR(DPH, 0x83);

SFR(SPSTAT,0x84);
// (bits in SPSTAT)
#define SPIF         0x80
#define WCOL         0x40
#define THRF         0x20
#define SPIBSY       0x10
#define MODF         0x08
#define SPR2         0x01


SFR(SPCON,0x85);

// (bits in SPCON)
#define SSIG         0x80
#define SPEN         0x40
#define DORD         0x20
#define MSTR         0x10
#define CPOL         0x08
#define CPHA         0x04
#define SPR1         0x02
#define SPR0         0x01

SFR(SPDAT,0x86);

SFR(PCON0,0x87);
// (bits in PCON0)
#define SMOD1        0x80
#define SMOD0        0x40
#define POF0         0x10
#define PD           0x02
#define IDL          0x01


SFR(TCON,0x88);
// (bits in TCON)
/*  TCON  */
__sbit __at (0x88) IT0  ;
__sbit __at (0x89) IE0  ;
__sbit __at (0x8A) IT1  ;
__sbit __at (0x8B) IE1  ;
__sbit __at (0x8C) TR0  ;
__sbit __at (0x8D) TF0  ;
__sbit __at (0x8E) TR1  ;
__sbit __at (0x8F) TF1  ;


SFR(TMOD,0x89);
// (bits in TMOD)
#define T1GATE       0x80
#define T1C_T        0x40
#define T1M1         0x20
#define T1M0         0x10
#define T0GATE       0x08
#define T0C_T        0x04
#define T0M1         0x02
#define T0M0         0x01


SFR(TL0,0x8A);
SFR(TL1,0x8B);
SFR(TH0,0x8C);
SFR(TH1,0x8D);

SFR(SFIE,0x8E);
// (bits in SFIE)
#define SIDFIE       0x80
#define RTCFIE       0x10
#define BOF1IE       0x04
#define BOF0IE       0x02
#define WDTFIE       0x01

SFR(XRPS,0x8F);

SFR(P1,0x90);
// (bits in P1)
__sbit __at (0x90) P10 ;
__sbit __at (0x91) P11 ;
__sbit __at (0x92) P12 ;
__sbit __at (0x93) P13 ;
__sbit __at (0x94) P14 ;
__sbit __at (0x95) P15 ;
__sbit __at (0x96) P16 ;
__sbit __at (0x97) P17 ;


SFR(P1M0,0x91);
// (bits in P1M0)
#define P1M07        0x80
#define P1M06        0x40
#define P1M05        0x20
#define P1M01        0x02
#define P1M00        0x01


SFR(P1M1,0x92);
// (bits in P1M1)
#define P1M17        0x80
#define P1M16        0x40
#define P1M15        0x20
#define P1M11        0x02
#define P1M10        0x01


SFR(P2M1,0x92);
// (bits in P2M1)
#define P2M14        0x10
#define P2M12        0x04


SFR(P4M1,0x92);
// (bits in P4M1)
#define P4M17        0x80
#define P4M15        0x20
#define P4M14        0x10


SFR(P6M1,0x92);
// (bits in P6M1)
#define P6M11        0x02
#define P6M10        0x01

SFR(P3FDC,0x92);
SFR(P1FDC,0x92);
SFR(P2FDC,0x92);
SFR(P4FDC,0x92);

SFR(T2MOD1,0x93);
// (bits in T2MOD1)
#define TL2CS        0x80
#define TF2IG        0x40
#define TL2IS        0x20
#define T2CKS        0x10
#define T2MS1        0x08
#define CP2S2        0x04
#define CP2S1        0x02
#define CP2S0        0x01


SFR(T3MOD1,0x93);
// (bits in T3MOD1)
#define TL3CS        0x80
#define TF3IG        0x40
#define T3CKS        0x10
#define T3MS1        0x08
#define CP3S2        0x04
#define CP3S1        0x02
#define CP3S0        0x01


SFR(DMACR0,0x94);
// (bits in DMACR0)
#define DMAE0        0x08
#define DMAS0        0x04
#define DIE0         0x02
#define DCF0         0x01


SFR(DMACG0,0x94);
// (bits in DMACG0)
#define PDMAH        0x80
#define PDMAL        0x40
#define CRCW0        0x20
#define EXTS10       0x08
#define EXTS00       0x04
#define FAEN0        0x02
#define LOOP0        0x01


SFR(DMADS0,0x94);
// (bits in DMADS0)
#define DSS30        0x80
#define DSS20        0x40
#define DSS10        0x20
#define DSS00        0x10
#define DDS30        0x08
#define DDS20        0x04
#define DDS10        0x02
#define DDS00        0x01


SFR(P2M0,0x95);
// (bits in P2M0)
#define P2M04        0x10
#define P2M02        0x04


SFR(TREN0,0x95);
// (bits in TREN0)
#define TR3LE        0x40
#define TR2LE        0x20
#define TR3E         0x08
#define TR2E         0x04
#define TR1E         0x02
#define TR0E         0x01


SFR(TRLC0,0x95);
// (bits in TRLC0)
#define TL3RLC       0x40
#define TL2RLC       0x20
#define T3RLC        0x08
#define T2RLC        0x04
#define T1RLC        0x02
#define T0RLC        0x01


SFR(TSPC0,0x95);
// (bits in TSPC0)
#define TL3SC        0x40
#define TL2SC        0x20
#define T3SC         0x08
#define T2SC         0x04
#define T1SC         0x02
#define T0SC         0x01

SFR(BOREV,0x96);

SFR(PCON1,0x97);
// (bits in PCON1)
#define SWRF         0x80
#define EXRF         0x40
#define RTCF         0x10
#define BOF1         0x04
#define BOF0         0x02
#define WDTF         0x01


SFR(S0CON,0x98);
// (bits in S0CON)
__sbit __at (0x98) RI0   ;
__sbit __at (0x99) TI0   ;
__sbit __at (0x9A) RB80 ;
__sbit __at (0x9B) TB80  ;
__sbit __at (0x9C) REN0 ;
__sbit __at (0x9D) SM20  ;
__sbit __at (0x9E) SM10  ;
__sbit __at (0x9F) SM00  ;


SFR(S1CON,0x98);
// (bits in S1CON)
__sbit __at (0x98) RI1   ;
__sbit __at (0x99) TI1   ;
__sbit __at (0x9A) RB81 ;
__sbit __at (0x9B) TB81  ;
__sbit __at (0x9C) REN1 ;
__sbit __at (0x9D) SM21  ;
__sbit __at (0x9E) SM11  ;
__sbit __at (0x9F) SM01  ;


SFR(S0BUF,0x99);
SFR(S1BUF,0x99);
SFR(S0BRT,0x9A);
SFR(S1BRT,0x9A);
SFR(S0BRC,0x9B);
SFR(S1BRC,0x98);

SFR(S0CFG,0x9C);
// (bits in S0CFG)
#define URTS         0x80
#define SMOD2        0x40
#define URM0X3       0x20
#define SM30         0x10
#define S0DOR        0x08
#define BTI          0x04
#define UTIE         0x02
#define SMOD3        0x01


SFR(S1CFG,0x9C);
// (bits in S1CFG)
#define SM31         0x80
#define S1M0X3       0x40
#define S1DOR        0x20
#define S1TR         0x10
#define S1MOD1       0x08
#define S1TX12       0x04
#define S1CKOE       0x02
#define S1TME        0x01


SFR(S0CFG1,0x9D);
// (bits in S0CFG1)
#define SBF0         0x80
#define TXER0        0x40
#define S0SB16       0x20
#define ATBR0        0x10
#define TXRX0        0x08
#define SYNC0        0x04


SFR(P2,0xA0);
// (bits in P2)
__sbit __at(0xA2)   P22 ;
__sbit __at(0xA4)   P24 ;


SFR(AUXR0,0xA1);
// (bits in AUXR0)
#define P60OC1       0x80
#define P60OC0       0x40
#define P60FD        0x20
#define PBKF         0x10
#define INT1H        0x02
#define INT0H        0x01


