PranjalKushwaha/Embedded/stm8/NRF24_TRANS/driver/include/REG_MG82F6D17.h
SFR(AUXR1,0xA2);
// (bits in AUXR1)
#define CRCDS1       0x20
#define CRCDS0       0x10
#define DPS          0x01


SFR(AUXR2,0xA3);
// (bits in AUXR2)
#define STAF         0x80
#define STOF         0x40
#define T1X12        0x08
#define T0X12        0x04
#define T1CKOE       0x02
#define T0CKOE       0x01


SFR(AUXR3,0xA4);
// (bits in AUXR3)
#define T0PS1        0x80
#define T0PS0        0x40
#define BPOC1        0x20
#define BPOC0        0x10
#define S0PS0        0x08
#define TWIPS1       0x04
#define TWIPS0       0x02
#define T0XL         0x01


SFR(AUXR4,0xA4);
// (bits in AUXR4)
#define T2PS1        0x80
#define T2PS0        0x40
#define T1PS1        0x20
#define T1PS0        0x10


SFR(AUXR5,0xA4);
// (bits in AUXR5)
#define C0IC4S0      0x80
#define C0IC2S0      0x40
#define C0PPS1       0x20
#define C0PPS0       0x10
#define C0PS0        0x04
#define ECIPS0       0x02
#define C0COPS       0x01


SFR(AUXR6,0xA4);
// (bits in AUXR6)
#define KBI4PS1      0x80
#define KBI4PS0      0x40
#define KBI6PS0      0x20
#define KBI2PS0      0x10
#define SnMIPS       0x02
#define S0COPS       0x01


SFR(AUXR7,0xA4);
// (bits in AUXR7)
#define POE5         0x80
#define POE4         0x40
#define C0CKOE       0x20
#define SPI0M0       0x10


SFR(AUXR8,0xA4);
// (bits in AUXR8)
#define POE7         0x80
#define POE6         0x40
#define C0PPS2       0x20
#define KBI0PS0      0x08
#define S1COPS       0x04


SFR(AUXR9,0xA4);
// (bits in AUXR9)
#define T1G1         0x20
#define T0G1         0x10
#define C0FDC1       0x08
#define C0FDC0       0x04
#define S1PS1        0x02
#define S1PS0        0x01


SFR(AUXR10,0xA4);
// (bits in AUXR10)
#define SPIPS0       0x10
#define S0PS1        0x08
#define TWICF        0x02
#define PAA          0x01


SFR(AUXR11,0xA4);
// (bits in AUXR11)
#define P30AM        0x80
#define C0M0         0x02
#define C0OFS        0x01


SFR(EIE2,0xA5);
// (bits in EIE2)
#define ET3          0x01


SFR(EIP2L,0xA6);
// (bits in EIP2L)
#define PT3L         0x01


SFR(EIP2H,0xA7);
// (bits in EIP2H)
#define PT3H         0x01


SFR(IE,0xA8);
// (bits in IE)
__sbit __at(0xAF)   EA ;
__sbit __at(0xAE)   EDMA ;
__sbit __at(0xAD)   ET2 ;
__sbit __at(0xAC)   ES0 ;
__sbit __at(0xAB)   ET1 ;
__sbit __at(0xAA)   EX1 ;
__sbit __at(0xA9)   ET0 ;
__sbit __at(0xA8)   EX0 ;


SFR(ADDR,0xA9);

SFR(SFRPI,0xAC);
// (bits in SFRPI)
#define IDX3         0x08
#define IDX2         0x04
#define IDX1         0x02
#define IDX0         0x01


SFR(EIE1,0xAD);
// (bits in EIE1)
#define ETWI0        0x40
#define EKB          0x20
#define ES1          0x10
#define ESF          0x08
#define EPCA         0x04
#define EADC         0x02
#define ESPI         0x01


SFR(EIP1L,0xAE);
// (bits in EIP1L)
#define PTWI0L       0x40
#define PKBL         0x20
#define PS1L         0x10
#define PSFL         0x08
#define PPCAL        0x04
#define PADCL        0x02
#define PSPIL        0x01


SFR(EIP1H,0xAF);
// (bits in EIP1H)
#define PTWI0H       0x40
#define PKBH         0x20
#define PS1H         0x10
#define PSFH         0x08
#define PPCAH        0x04
#define PADCH        0x02
#define PSPIH        0x01


SFR(P3,0xB0);
// (bits in P3)
__sbit __at(0xB5)   P35 ;
__sbit __at(0xB4)   P34 ;
__sbit __at(0xB3)   P33 ;
__sbit __at(0xB1)   P31 ;
__sbit __at(0xB0)   P30 ;


SFR(P3M0,0xB1);
// (bits in P3M0)
#define P3M05        0x20
#define P3M04        0x10
#define P3M03        0x08
#define P3M01        0x02
#define P3M00        0x01


SFR(P3M1,0xB2);
// (bits in P3M1)
#define P3M15        0x20
#define P3M14        0x10
#define P3M13        0x08
#define P3M11        0x02
#define P3M10        0x01


SFR(P4M0,0xB3);
// (bits in P4M0)
#define P4M07        0x80
#define P4M05        0x20
#define P4M04        0x10


SFR(PDRVC0,0xB4);
// (bits in PDRVC0)
#define P3DC1        0x80
#define P3DC0        0x40
#define P2DC1        0x20
#define P2DC0        0x10
#define P1DC1        0x08
#define P1DC0        0x04


SFR(PDRVC1,0xB4);
// (bits in PDRVC1)
#define P4DC1        0x02


SFR(P6M0,0xB5);
// (bits in P6M0)
#define P6M01        0x02
#define P6M00        0x01


SFR(RTCTM,0xB6);
// (bits in RTCTM)
#define RTCCS1       0x80
#define RTCCS0       0x40
#define RTCCT5       0x20
#define RTCCT4       0x10
#define RTCCT3       0x08
#define RTCCT2       0x04
#define RTCCT1       0x02
#define RTCCT0       0x01


SFR(IP0H,0xB7);
// (bits in IP0H)
#define PX2H         0x40
#define PT2H         0x20
#define PSH          0x10
#define PT1H         0x08
#define PX1H         0x04
#define PT0H         0x02
#define PX0H         0x01


SFR(IP0L,0xB8);
// (bits in IP0L)
__sbit __at(0xBE)   PX2L ;
__sbit __at(0xBD)   PT2L ;
__sbit __at(0xBC)   PSL  ;
__sbit __at(0xBB)   PT1L ;
__sbit __at(0xBA)   PX1L ;
__sbit __at(0xB9)   PT0L ;
__sbit __at(0xB8)   PX0L ;

SFR(SADEN,0xB9);

SFR(S0CR1,0xB9);
// (bits in S0CR1)
#define S0TR         0x80
#define S0TX12       0x40
#define S0TCK        0x20
#define S0RCK        0x10
#define S0CKOE       0x08
#define ARTE         0x04


SFR(PWMCR,0xBC);
// (bits in PWMCR)
#define PCAE         0x80
#define EXDT         0x40
#define PBKM         0x20
#define PBKE11       0x10
#define PBKE10       0x08
#define PBKE02       0x04
#define PBKE01       0x02
#define PBKE00       0x01


SFR(PDTCRA,0xBC);
// (bits in PDTCRA)
#define DTPS1        0x80
#define DTPS0        0x40
#define DT5          0x20
#define DT4          0x10
#define DT3          0x08
#define DT2          0x04
#define DT1          0x02
#define DT0          0x01

SFR(CRC0DA,0xBD);

SFR(RTCCR,0xBE);
// (bits in RTCCR)
#define RTCE         0x80
#define RTCO         0x40
#define RTCRL5       0x20
#define RTCRL4       0x10
#define RTCRL3       0x08
#define RTCRL2       0x04
#define RTCRL1       0x02
#define RTCRL0       0x01

SFR(CKCON1,0xBF);

SFR(XICON,0xC0);
// (bits in XICON)
__sbit __at(0xC2)   INT2H ;
__sbit __at(0xC2)   EX2 ;
__sbit __at(0xC1)   IE2 ;
__sbit __at(0xC0)   IT2 ;


SFR(XICFG,0xC1);
// (bits in XICFG)
#define INT1IS1      0x80
#define INT1IS0      0x40
#define INT0IS1      0x20
#define INT0IS0      0x10
#define X2FLT        0x04
#define X1FLT        0x02
#define X0FLT        0x01


SFR(XICFG1,0xC1);
// (bits in XICFG1)
#define INT1IS2      0x80
#define INT0IS2      0x40
#define INT2IS1      0x20
#define INT2IS0      0x10
#define X2FLT1       0x04
#define X1FLT1       0x02
#define X0FLT1       0x01


SFR(ADCFG0,0xC3);
// (bits in ADCFG0)
#define ADCKS2       0x80
#define ADCKS1       0x40
#define ADCKS0       0x20
#define ADRJ         0x10
#define ACHS         0x08
#define SMPF         0x04
#define ADTM1        0x02
#define ADTM0        0x01


