PranjalKushwaha/Embedded/stm8/NRF24_TRANS/driver/include/REG_MG82F6D17.h
SFR(ADCFG1,0xC3);
// (bits in ADCFG1)
#define IGADCI       0x80
#define EADCWI       0x40
#define SMPFIE       0x20
#define SIGN         0x10
#define AOS3         0x08
#define AOS2         0x04
#define AOS1         0x02
#define AOS0         0x01


SFR(ADCFG2,0xC3);
// (bits in ADCFG2)
#define SHT7         0x80
#define SHT6         0x40
#define SHT5         0x20
#define SHT4         0x10
#define SHT3         0x08
#define SHT2         0x04
#define SHT1         0x02
#define SHT0         0x01


SFR(ADCFG3,0xC3);
// (bits in ADCFG3)
#define ADPS1        0x80
#define ADPS0        0x40
#define ARES1        0x08
#define ARES0        0x04
#define ADES0        0x02


SFR(ADCFG4,0xC3);
// (bits in ADCFG4)
#define ADWM0        0x40
#define ADTM3        0x20
#define ADTM2        0x10
#define DBSD         0x02
#define DOSD         0x01

SFR(ADCFG5,0xC3);
// (bits in ADCFG5)
#define ASCE7        0x80
#define ASCE6        0x40
#define ASCE5        0x20
#define ASCE4        0x10
#define ASCE3        0x08
#define ASCE2        0x04
#define ASCE1        0x02
#define ASCE0        0x01


SFR(ADCFG11,0xC3);
// (bits in ADCFG11)
#define WHB3         0x80
#define WHB2         0x40
#define WHB1         0x20
#define WHB0         0x10


SFR(ADCFG12,0xC3);
// (bits in ADCFG12)
#define WHB11        0x80
#define WHB10        0x40
#define WHB9         0x20
#define WHB8         0x10
#define WHB7         0x08
#define WHB6         0x04
#define WHB5         0x02
#define WHB4         0x01


SFR(ADCFG13,0xC3);
// (bits in ADCFG13)
#define WLB3         0x80
#define WLB2         0x40
#define WLB1         0x20
#define WLB0         0x10


SFR(ADCFG14,0xC3);
// (bits in ADCFG14)
#define WLB11        0x80
#define WLB10        0x40
#define WLB9         0x20
#define WLB8         0x10
#define WLB7         0x08
#define WLB6         0x04
#define WLB5         0x02
#define WLB4         0x01


SFR(ADCON0,0xC4);
// (bits in ADCON0)
#define ADCEN        0x80
#define ADCWI        0x40
#define CHS3         0x20
#define ADCI         0x10
#define ADCS         0x08
#define CHS2         0x04
#define CHS1         0x02
#define CHS0         0x01


SFR(ADCDL,0xC5);
// (bits in ADCDL)
#define ADCV3        0x80
#define ADCV2        0x40
#define ADCV1        0x20
#define ADCV0        0x10


SFR(ADCDH,0xC6);
// (bits in ADCDH)
#define ADCV11       0x80
#define ADCV10       0x40
#define ADCV9        0x20
#define ADCV8        0x10
#define ADCV7        0x08
#define ADCV6        0x04
#define ADCV5        0x02
#define ADCV4        0x01


SFR(CKCON0,0xC7);
// (bits in CKCON0)
#define AFS          0x80
#define ENCKM        0x40
#define CKMIS1       0x20
#define CKMIS0       0x10
#define CCKS         0x08
#define SCKS2        0x04
#define SCKS1        0x02
#define SCKS0        0x01


SFR(T2CON,0xC8);
// (bits in T2CON)
__sbit __at(0xCF)   TF2 ;
__sbit __at(0xCE)   EXF2;
__sbit __at(0xCD)   RCLK_TF2L ;
__sbit __at(0xCC)   TCLK_TL2IE ;
__sbit __at(0xCB)   EXEN2 ;
__sbit __at(0xCA)   TR2;
__sbit __at(0xC9)   C_T2 ;
__sbit __at(0xC8)   CP_RL2 ;



SFR(T3CON,0xC8);
// (bits in T3CON)
__sbit __at(0xCF)   TF3 ;
__sbit __at(0xCE)   EXF3;
__sbit __at(0xCD)   TF3L ;
__sbit __at(0xCC)   TL3IE ;
__sbit __at(0xCB)   EXEN3 ;
__sbit __at(0xCA)   TR3;
__sbit __at(0xC9)   C_T3 ;
__sbit __at(0xC8)   CP_RL3 ;


SFR(T5CON,0xC8);
// (bits in T5CON)
__sbit __at(0xCF)   TF5 ;
__sbit __at(0xCD)   T5CKS1;
__sbit __at(0xCC)   T5CKS0 ;
__sbit __at(0xCB)   T51E ;
__sbit __at(0xCA)   TR5;
__sbit __at(0xC9)   T5GAT1 ;
__sbit __at(0xC8)   T5GAT0 ;


SFR(T6CON,0xC8);
// (bits in T6CON)
__sbit __at(0xCF)   TF6 ;
__sbit __at(0xCD)   T6CKS1;
__sbit __at(0xCC)   T6CKS0 ;
__sbit __at(0xCB)   T61E ;
__sbit __at(0xCA)   TR6;
__sbit __at(0xC9)   T6GAT1 ;
__sbit __at(0xC8)   T6GAT0 ;



SFR(T2MOD,0xC9);
// (bits in T2MOD)
#define T2SPL        0x80
#define TL2X12       0x40
#define T2EXH        0x20
#define T2X12        0x10
#define TR2L         0x08
#define TR2LC        0x04
#define T2OE         0x02
#define T2MS0        0x01


SFR(T3MOD,0xC9);
// (bits in T3MOD)
#define T3SPL        0x80
#define TL3X12       0x40
#define T3EXH        0x20
#define T3X12        0x10
#define TR3L         0x08
#define TR3LC        0x04
#define T3OE         0x02
#define T3MS0        0x01

SFR(RCAP2L,0xCA);
SFR(RCAP3L,0xCA);
SFR(TLR5,0xCA);
SFR(TLR6,0xCA);
SFR(RCAP2H,0xCB);
SFR(RCAP3H,0xCB);
SFR(THR5,0xCB);
SFR(THR6,0xCB);
SFR(TL2,0xCC);
SFR(TL3,0xCC);
SFR(TL5,0xCC);
SFR(TL6,0xCC);
SFR(TH2,0xCD);
SFR(TH3,0xCD);
SFR(TH5,0xCD);
SFR(TH6,0xCD);
SFR(CLRL,0xCE);
SFR(CHRL,0xCF);

SFR(PSW,0xD0);
// (bits in PSW)
__sbit __at(0xD7)   CY ;
__sbit __at(0xD6)   AC ;
__sbit __at(0xD5)   F0;
__sbit __at(0xD4)   RS1 ;
__sbit __at(0xD3)   RS0 ;
__sbit __at(0xD2)   OV;
__sbit __at(0xD1)   F1 ;
__sbit __at(0xD0)   P ;


SFR(SIADR,0xD1);
// (bits in SIADR)
#define GC           0x01

SFR(SIDAT,0xD2);
SFR(SISTA,0xD3);

SFR(SICON,0xD4);
// (bits in SICON)
#define CR2          0x80
#define ENSI         0x40
#define STA          0x20
#define STO          0x10
#define SI           0x08
#define AA           0x04
#define CR1          0x02
#define CR0          0x01

SFR(KBPATN,0xD5);

SFR(KBCON,0xD6);
// (bits in KBCON)
#define KBCS1        0x80
#define KBCS0        0x40
#define KBES         0x20
#define PATN_SEL     0x02
#define KBIF         0x01

SFR(KBMASK,0xD7);

SFR(CCON,0xD8);
// (bits in CCON)
__sbit __at(0xDF)   CF ;
__sbit __at(0xDE)   CR ;
__sbit __at(0xDD)   CCF5 ;
__sbit __at(0xDC)   CCF4 ;
__sbit __at(0xDB)   CCF3 ;
__sbit __at(0xDA)   CCF2 ;
__sbit __at(0xD9)   CCF1 ;
__sbit __at(0xD8)   CCF0 ;


SFR(CMOD,0xD9);
// (bits in CMOD)
#define CIDL         0x80
#define BME4         0x40
#define BME2         0x20
#define BME0         0x10
#define CPS2         0x08
#define CPS1         0x04
#define CPS0         0x02
#define ECF          0x01


SFR(CCAPM0,0xDA);
// (bits in CCAPM0)
#define DTE0         0x80
#define ECOM0        0x40
#define CAPP0        0x20
#define CAPN0        0x10
#define MAT0         0x08
#define TOG0         0x04
#define PWM0         0x02
#define ECCF0        0x01


SFR(CCAPM6,0xDA);
// (bits in CCAPM6)
#define BME6         0x80
#define ECOM6        0x40
#define CAPN6        0x10
#define MAT6         0x08
#define TOG6         0x04
#define PWM6         0x02
#define ECCF6        0x01


SFR(CCAPM1,0xDB);
// (bits in CCAPM1)
#define ECOM1        0x40
#define CAPP1        0x20
#define CAPN1        0x10
#define MAT1         0x08
#define TOG1         0x04
#define PWM1         0x02
#define ECCF1        0x01


SFR(CCAPM7,0xDB);
// (bits in CCAPM7)
#define ECOM7        0x40
#define CAPN7        0x10
#define MAT7         0x08
#define TOG7         0x04
#define PWM7         0x02
#define ECCF7        0x01


SFR(CCAPM2,0xDC);
// (bits in CCAPM2)
#define DTE2         0x80
#define ECOM2        0x40
#define CAPP2        0x20
#define CAPN2        0x10
#define MAT2         0x08
#define TOG2         0x04
#define PWM2         0x02
#define ECCF2        0x01


SFR(CCAPM3,0xDD);
// (bits in CCAPM3)
#define ECOM3        0x40
#define CAPP3        0x20
#define CAPN3        0x10
#define MAT3         0x08
#define TOG3         0x04
#define PWM3         0x02
#define ECCF3        0x01


SFR(CCAPM4,0xDE);
// (bits in CCAPM4)
#define DTE4         0x80
#define ECOM4        0x40
#define CAPP4        0x20
#define CAPN4        0x10
#define MAT4         0x08
#define TOG4         0x04
#define PWM4         0x02
#define ECCF4        0x01


