PranjalKushwaha/Embedded/stm8/NRF24_TRANS/driver/include/REG_MG82F6D17.h
SFR(CCAPM5,0xDF);
// (bits in CCAPM5)
#define ECOM5        0x40
#define CAPP5        0x20
#define CAPN5        0x10
#define MAT5         0x08
#define TOG5         0x04
#define PWM5         0x02
#define ECCF5        0x01


SFR(ACC,0xE0);
// (bits in ACC)
__sbit __at(0xE7)   ACC7 ;
__sbit __at(0xE6)   ACC6 ;
__sbit __at(0xE5)   ACC5 ;
__sbit __at(0xE4)   ACC4 ;
__sbit __at(0xE3)   ACC3 ;
__sbit __at(0xE2)   ACC2 ;
__sbit __at(0xE1)   ACC1 ;
__sbit __at(0xE0)   ACC0 ;


SFR(WDTCR,0xE1);
// (bits in WDTCR)
#define WREN         0x80
#define NSW          0x40
#define ENW          0x20
#define CLRW         0x10
#define WIDL         0x08
#define PS2          0x04
#define PS1          0x02
#define PS0          0x01

SFR(IFD,0xE2);
SFR(IFADRH,0xE3);
SFR(IFADRL,0xE4);

SFR(IFMT,0xE5);
// (bits in IFMT)
#define MS7          0x80
#define MS2          0x04
#define MS1          0x02
#define MS0          0x01

SFR(SCMD,0xE6);

SFR(ISPCR,0xE7);
// (bits in ISPCR)
#define ISPEN        0x80
#define SWBS         0x40
#define SRST         0x20
#define CFAIL        0x10


SFR(P4,0xE8);
// (bits in P4)
__sbit __at(0xEF)   P47 ;
__sbit __at(0xED)   P45;
__sbit __at(0xEC)   P44 ;


SFR(CL,0xE9);
SFR(CCAP0L,0xEA);
SFR(CCAP6L,0xEA);
SFR(CCAP1L,0xEB);
SFR(CCAP7L,0xEB);
SFR(CCAP2L,0xEC);
SFR(CCAP3L,0xED);
SFR(CCAP4L,0xEE);
SFR(CCAP5L,0xEF);

SFR(B,0xF0);
// (bits in B)
__sbit __at(0xF7)   B7 ;
__sbit __at(0xF6)   B6 ;
__sbit __at(0xF5)   B5 ;
__sbit __at(0xF4)   B4 ;
__sbit __at(0xF3)   B3 ;
__sbit __at(0xF2)   B2 ;
__sbit __at(0xF1)   B1 ;
__sbit __at(0xF0)   B0 ;


SFR(PAOE,0xF1);
// (bits in PAOE)
#define POE3         0x80
#define POE2B        0x40
#define POE2A        0x20
#define POE2         0x10
#define POE1         0x08
#define POE0B        0x04
#define POE0A        0x02
#define POE0         0x01


SFR(PCAPWM0,0xF2);
// (bits in PCAPWM0)
#define P0RS1        0x80
#define P0RS0        0x40
#define P0INV        0x04
#define ECAP0H       0x02
#define ECAP0L       0x01


SFR(PCAPWM6,0xF2);
// (bits in PCAPWM6)
#define P6RS1        0x80
#define P6RS0        0x40
#define CCF6         0x08
#define P6INV        0x04
#define ECAP6H       0x02
#define ECAP6L       0x01


SFR(PCAPWM1,0xF3);
// (bits in PCAPWM1)
#define P1RS1        0x80
#define P1RS0        0x40
#define P1INV        0x04
#define ECAP1H       0x02
#define ECAP1L       0x01


SFR(PCAPWM7,0xF3);
// (bits in PCAPWM7)
#define P7RS1        0x80
#define P7RS0        0x40
#define CCF7         0x08
#define P7INV        0x04
#define ECAP7H       0x02
#define ECAP7L       0x01


SFR(PCAPWM2,0xF4);
// (bits in PCAPWM2)
#define P2RS1        0x80
#define P2RS0        0x40
#define P2INV        0x04
#define ECAP2H       0x02
#define ECAP2L       0x01


SFR(PCAPWM3,0xF5);
// (bits in PCAPWM3)
#define P3RS1        0x80
#define P3RS0        0x40
#define P3INV        0x04
#define ECAP3H       0x02
#define ECAP3L       0x01


SFR(PCAPWM4,0xF6);
// (bits in PCAPWM4)
#define P4RS1        0x80
#define P4RS0        0x40
#define P4INV        0x04
#define ECAP4H       0x02
#define ECAP4L       0x01


SFR(PCAPWM5,0xF7);
// (bits in PCAPWM5)
#define P5RS1        0x80
#define P5RS0        0x40
#define P5INV        0x04
#define ECAP5H       0x02
#define ECAP5L       0x01


SFR(P6,0xF8);
// (bits in P6)
__sbit __at(0xF9)   P61 ;
__sbit __at(0xF8)   P60 ;


SFR(CH,0xF9);
SFR(CCAP0H,0xFA);
SFR(CCAP6H,0xFA);
SFR(CCAP1H,0xFB);
SFR(CCAP7H,0xFB);
SFR(CCAP2H,0xFC);
SFR(CCAP3H,0xFD);
SFR(CCAP4H,0xFE);
SFR(CCAP5H,0xFF);

//===== Page P =====//

#define IAPLB_P      0x03
// (bits in IAPLB)
#define IAPLB6_P     0x80
#define IAPLB5_P     0x40
#define IAPLB4_P     0x20
#define IAPLB3_P     0x10
#define IAPLB2_P     0x08
#define IAPLB1_P     0x04
#define IAPLB0_P     0x02


#define CKCON2_P     0x40
// (bits in CKCON2)
#define IHRCOE_P     0x10
#define MCKS1_P      0x08
#define MCKS0_P      0x04
#define OSCS1_P      0x02
#define OSCS0_P      0x01


#define CKCON3_P     0x41
// (bits in CKCON3)
#define WDTCS1_P     0x80
#define WDTCS0_P     0x40
#define FWKP_P       0x20
#define WDTFS_P      0x10
#define MCKD1_P      0x08
#define MCKD0_P      0x04


#define CKCON4_P     0x42
// (bits in CKCON4)
#define RCSS2_P      0x80
#define RCSS1_P      0x40
#define RCSS0_P      0x20
#define RPSC2_P      0x10
#define RPSC1_P      0x08
#define RPSC0_P      0x04
#define RTCCS3_P     0x02
#define RTCCS2_P     0x01


#define CKCON5_P     0x43
// (bits in CKCON5)
#define CKMS0_P      0x01


#define PCON2_P      0x44
// (bits in PCON2)
#define AWBOD1_P     0x80
#define AWBOD0_P     0x40
#define BO1S1_P      0x20
#define BO1S0_P      0x10
#define BO1RE_P      0x08
#define EBOD1_P      0x04
#define BO0RE_P      0x02


#define PCON3_P      0x45
// (bits in PCON3)
#define IVREN_P      0x80


#define SPCON0_P     0x48
// (bits in SPCON0)
#define P6CTL_P      0x40
#define P4CTL_P      0x20
#define WRCTL_P      0x10
#define CKCTL0_P     0x04
#define PWCTL1_P     0x02
#define PWCTL0_P     0x01


#define DCON0_P      0x4C
// (bits in DCON0)
#define HSE_P        0x80
#define IAPO_P       0x40
#define HSE1_P       0x20
#define IORCTL_P     0x04
#define RSTIO_P      0x02
#define OCDE_P       0x01


#define RTCCR_P      0x54
// (bits in RTCCR)
#define RTCE_P       0x80
#define RTCO_P       0x40
#define RTCRL5_P     0x20
#define RTCRL4_P     0x10
#define RTCRL3_P     0x08
#define RTCRL2_P     0x04
#define RTCRL1_P     0x02
#define RTCRL0_P     0x01


#define RTCTM_P      0x55
// (bits in RTCTM)
#define RTCCS1_P     0x80
#define RTCCS0_P     0x40
#define RTCCT5_P     0x20
#define RTCCT4_P     0x10
#define RTCCT3_P     0x08
#define RTCCT2_P     0x04
#define RTCCT1_P     0x02
#define RTCCT0_P     0x01


#define PCON0_P      0x80
// (bits in PCON0)
#define SMOD1_P      0x80
#define SMOD0_P      0x40
#define POF0_P       0x10
#define PD_P         0x02
#define IDL_P        0x01


#define PCON1_P      0x97
// (bits in PCON1)
#define SWRF_P       0x80
#define EXRF_P       0x40
#define RTCF_P       0x10
#define BOF1_P       0x04
#define BOF0_P       0x02
#define WDTF_P       0x01


#define CKCON0_P     0xC7
// (bits in CKCON0)
#define AFS_P        0x80
#define ENCKM_P      0x40
#define CKMIS1_P     0x20
#define CKMIS0_P     0x10
#define CCKS_P       0x08
#define SCKS2_P      0x04
#define SCKS1_P      0x02
#define SCKS0_P      0x01


#define WDTCR_P      0xE1
// (bits in WDTCR)
#define WREN_P       0x80
#define NSW_P        0x40
#define ENW_P        0x20
#define CLRW_P       0x10
#define WIDL_P       0x08
#define PS2_P        0x04
#define PS1_P        0x02
#define PS0_P        0x01


#define P4_P         0xE8
// (bits in P4)
#define P47_P        0x80
#define P45_P        0x20
#define P44_P        0x10


#define P6_P         0xF8
// (bits in P6)
#define P61_P        0x02
#define P60_P        0x01

#endif
